let x1 = prompt('Введите первую координату первой точки', )
let y1 = prompt('Введите втурую координату первой точки', )
let x2 = prompt('Введите первую координату второй точки', )
let y2 = prompt('Введите втурую координату второй точки', )
let x3 = prompt('Введите первую координату третьей точки', )
let y3 = prompt('Введите втурую координату третьей точки', )

if (x1==x2 ) {
    alert(`x4 = ${x3}`)
}
if (x3==x2 ) {
    alert(`x4 = ${x1}`)
}
if (x1==x3 ) {
    alert(`x4 = ${x2}`)
}

if (y1==y2) {
    alert(`y4 = ${y3}`)
}
if (y3==y2) {
    alert(`y4 = ${y1}`)
}
if (y1==y3) {
    alert(`y4 = ${y2}`)
}